
GetPassphraseDescription = "Вам нужен пароль, чтобы разблокировать секретный ключ для пользователя: \"%@\", ID %@";
GetPassphraseDescription_Subkey = "Вам нужен пароль, чтобы разблокировать секретный ключ для пользователя: \"%@\", ID %@, (ID основного ключа %@)";
PassphraseLabel = "Пароль:";




/* For Key-Status */
"Invalid" = "Неверный";
"Revoked" = "Аннулированный";
"Expired" = "Истёкший";
"Disabled" = "Отключенный";
"Unknown" = "Неизвестный";
"Never" = "Никогда";
"Marginal" = "Маргинальный";
"Full" = "Полный";
"Ultimate" = "Конечный";


/* For Undo and Redo */
Undo_NewKey = "Новый ключ";
Undo_Delete = "Удалить";
Undo_CleanKey = "Очистить";
Undo_MinimizeKey = "Минимизировать";
Undo_RevokeKey = "Аннулировать ключ";
Undo_ChangeExpirationDate = "Изменить срок действия";
Undo_ChangePassphrase = "Изменить пароль";
Undo_AlgorithmPreferences = "Изменить параметры алгоритма";
Undo_Import = "Импорт";
Undo_AddSignature = "Добавить подпись";
Undo_RemoveSignature = "Удалить подпись";
Undo_RevokeSignature = "Аннулировать подпись";
Undo_AddSubkey = "Добавить subkey";
Undo_RemoveSubkey = "Удалить subkey";
Undo_RevokeSubkey = "Аннулировать subkey";
Undo_AddUserID = "Добавить идентификатор пользователя";
Undo_RemoveUserID = "Удалить идентификатор пользователя";
Undo_RevokeUserID = "Аннулировать идентификатор пользователя";
Undo_PrimaryUserID = "Первичный идентификатор пользователя";
Undo_AddPhoto = "Добавить фото";
Undo_RefreshFromServer = "Обновить с сервера";
Undo_ReceiveFromServer = "Получить с сервера";



/* Algorithm names */
CIPHER_ALGO_NONE = "Нет";
CIPHER_ALGO_IDEA = "IDEA";
CIPHER_ALGO_3DES = "3DES";
CIPHER_ALGO_CAST5 = "CAST5";
CIPHER_ALGO_BLOWFISH = "BLOWFISH";
CIPHER_ALGO_AES = "AES";
CIPHER_ALGO_AES192 = "AES192";
CIPHER_ALGO_AES256 = "AES256";
CIPHER_ALGO_TWOFISH = "TWOFISH";
CIPHER_ALGO_CAMELLIA128 = "CAMELLIA128";
CIPHER_ALGO_CAMELLIA192 = "CAMELLIA192";
CIPHER_ALGO_CAMELLIA256 = "CAMELLIA256";
DIGEST_ALGO_MD5 = "MD5";
DIGEST_ALGO_SHA1 = "SHA1";
DIGEST_ALGO_RMD160 = "RMD160";
DIGEST_ALGO_SHA256 = "SHA256";
DIGEST_ALGO_SHA384 = "SHA384";
DIGEST_ALGO_SHA512 = "SHA512";
DIGEST_ALGO_SHA224 = "SHA224";
COMPRESS_ALGO_NONE = "Нет";
COMPRESS_ALGO_ZIP = "ZIP";
COMPRESS_ALGO_ZLIB = "ZLIB";
COMPRESS_ALGO_BZIP2 = "BZIP2";

GPG_RSAAlgorithm = "RSA";
GPG_RSAEncryptOnlyAlgorithm = "RSA-E";
GPG_RSASignOnlyAlgorithm = "RSA-S";
GPG_ElgamalEncryptOnlyAlgorithm = "ELG-E";
GPG_DSAAlgorithm = "DSA";
GPG_ECDHAlgorithm = "ECDH";
GPG_ECDSAAlgorithm = "ECDSA";
GPG_ElgamalAlgorithm = "ELG";
GPG_DiffieHellmanAlgorithm = "Диффи Хеллман";
GPG_EdDSAAlgorithm = "EdDSA";
"Algorithm_%i" = "Алгоритм_%i";

/* GPGSignature humanReadableDescription */
"Signed" = "Подписано";
"Signature expired" = "Подпись истекла";
"Key expired" = "Ключ истёк";
"Bad signature" = "Подпись и данные не совпадают. Это может означать, что данные были подделаны.";
"Signature revoked" = "Подпись аннулирована";
"Signature error" = "Ошибка подписи";
"Unverifiable signature" = "Подпись не может быть проверена.";
"Signed by stranger" = "Подпись не может быть проверена, так как отсутствует соответствующий открытый ключ.";


/* Key Descriptions */
KeyDescriptionAndMore = "и %lu более";


/* Key Expiry Warning */
KeyExpiryWarning_Title = "Внимание: срок действия ключа истекает";
KeyExpiryWarning_Msg = "Ваш ключ истечёт %1$@:\n\n%2$@\n\nИстекшие ключи не могут использоваться для шифрования или подписывания новых сообщений. Расшифровка будет продолжать работать. С помощью этого ключа ваши друзья не смогут отправлять зашифрованные сообщения.\n\nЕсли вы решите продлить свой ключ, он будет действовать ещё два года.\n\nВы хотите продлить свой ключ?";
KeyExpiryWarning_Yes = "Продлить ключ";
KeyExpiryWarning_No = "Отмена";
KeyExpiryWarning_Suppress = "Не спрашивать снова";

SubkeyExpiryWarning_Title = "Внимание: срок действия subkey истекает";
SubkeyExpiryWarning_Msg = "Ваш subkey истечёт %1$@:\n\n%2$@\n\nИстекшие subkey не могут использоваться для шифрования или подписывания новых сообщений. Расшифровка будет продолжать работать. С помощью этого subkey ваши друзья не смогут отправлять зашифрованные сообщения.\n\nЕсли вы решите продлить свой subkey, он будет действовать ещё два года.\n\nВы хотите продлить свой subkey?";
SubkeyExpiryWarning_Yes = "Продлить subkey";
SubkeyExpiryWarning_No = "Отмена";
SubkeyExpiryWarning_Suppress = "Не спрашивать снова";

WrongPasswordTryAgain_Title = "Вы ввели неверный пароль";
WrongPasswordTryAgain_Msg = "Вы хотите попробовать ещё раз?";
WrongPasswordTryAgain_Yes = "Попробовать снова";
WrongPasswordTryAgain_No = "Отмена";

KeyExpiryFailed_Title = "Не удалось продлить ваш ключ!";
KeyExpiryFailed_Msg = "Ключ\n%1$@\nне может быть продлён.\nОшибка: %2$@";

KeyExtendedWantToUpload_Title = "Ваш ключ был успешно продлён";
KeyExtendedWantToUpload_Msg = "Для того, чтобы другие могли видеть новую дату истечения срока действия, им необходимо импортировать обновлённый ключ. Поэтому рекомендуется выгружать обновлённый открытый ключ на серверы ключей.\n\nВнимание: серверы ключей являются общедоступными, поэтому имя и адрес электронной почты, которые вы используете в своем ключе, будут общедоступны. Ключи не могут быть удалены с серверов ключей. Они могут быть отозваны, но не удалены.\n\nЕсли вы предпочитаете не использовать серверы ключей, то рассмотрите возможность добавления открытого ключа в подписанные и зашифрованные электронные письма.\n\nВы хотите выгрузить свой открытый ключ?";
KeyExtendedWantToUpload_Yes = "Выгрузить открытый ключ";
KeyExtendedWantToUpload_No = "Нет, спасибо!";

UploadFailed_Title = "Не удалось выгрузить ключ!";
UploadFailed_Msg = "Ключ нельзя выгрузить на сервер ключей.\n\nОшибка: %@";


UpdaterNotWorking_Title = "GPG Suite Updater не работает должным образом!";
UpdaterNotWorking_Msg = "Пожалуйста, скачайте и переустановите GPG Suite с https://gpgtools.org";


SwitchToOldKeyserver_Title = "Предупреждение. Вы собираетесь переключить сервер ключей.";
SwitchToOldKeyserver_Msg = "Переключение на старые серверы ключей приведёт к снижению качества результатов поиска. Хотя keys.openpgp.org позволяет проверять адрес электронной почты и только тогда будет показывать электронную почту в результатах поиска, старые серверы ключей не поддерживают этот механизм.\n\nМы рекомендуем продолжать использовать keys.openpgp.org\n\nВы действительно хотите переключить сервер ключей?";
SwitchToOldKeyserver_No = "Отмена";
SwitchToOldKeyserver_Yes = "Переключиться на старый сервер ключей";


